nc: 16
depth_multiple: 1.00
width_multiple: 1.00

anchors:
  - [66,59, 87,77, 113,110]     # P3/8 anchors
  - [125,172, 182,134, 186,221] # P4/16 anchors
  - [277,205, 354,301, 499,518] # P5/32 anchors

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],  # 0

   [-1, 1, Conv, [64, 3, 2]],  # 1 - Downsample (P1/2)
   [-1, 1, Conv, [64, 3, 1]],

   [-1, 1, Conv, [128, 3, 2]],  # 3 - Downsample (P2/4)
   [-1, 1, BottleneckCSP, [128, False]],  # Bottleneck for depth reduction

   [-1, 1, Conv, [256, 3, 2]],  # 5 - Downsample (P3/8)
   [-1, 1, BottleneckCSP, [256, False]],

   [-1, 1, Conv, [512, 3, 2]],  # 7 - Downsample (P4/16)
   [-1, 1, BottleneckCSP, [512, False]],

   [-1, 1, Conv, [1024, 3, 2]],  # 9 - Downsample (P5/32)
   [-1, 1, BottleneckCSP, [1024, False]],  # Bottleneck at the deepest layer
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]],  # Spatial Pyramid Pooling (SPP) for multi-scale features

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # Upsample for feature fusion
   [7, 1, Conv, [256, 1, 1]],  # Route backbone P4
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, BottleneckCSP, [256, False]],  # Bottleneck for P4/16
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [5, 1, Conv, [128, 1, 1]],  # Route backbone P3/8
   [[-1, -2], 1, Concat, [1]],

   [-1, 1, BottleneckCSP, [128, False]],  # Bottleneck for P3/8
   [-1, 1, Conv, [64, 1, 1]],  # Further refine the low-level features

   [-1, 1, MP, []],  # MaxPooling for downsample
   [-1, 1, Conv, [128, 1, 1]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],  # Downsample
   [[-1, -3], 1, Concat, [1]],  # Combine with P4/16

   [-1, 1, BottleneckCSP, [256, False]],  # Bottleneck for P4/16
   [-1, 1, MP, []],  # MaxPooling for further downsample
   [-1, 1, Conv, [256, 1, 1]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],  # Downsample to P5/32
   [[-1, -3], 1, Concat, [1]],  # Combine with P5/32

   [-1, 1, BottleneckCSP, [512, False]],  # Final bottleneck at highest level
   [-1, 1, Conv, [1024, 1, 1]],  # High-level feature map refinement

   [63, 1, RepConv, [256, 3, 1]],  # RepVGG block for P3
   [75, 1, RepConv, [512, 3, 1]],  # RepVGG block for P4
   [88, 1, RepConv, [1024, 3, 1]],  # RepVGG block for P5

   [[101, 102, 103], 1, IDetect, [nc, anchors]],  # Final detection layers (P3, P4, P5)
  ]